renesas/ArduinoCore-rl78/libraries/SD/src/Tfat_Drivers/mmc_driver/mmc/rl78/rl78g23_csi_llvm/r_mmc_sfr.h
/*""FILE COMMENT""*******************************************************************
* File Name     : r_mmc_sfr.h
* Version       : 1.00
* Device(s)     : RL78/G23
* compiler      : CC-RL
* H/W Platform  : R7F100Gxx
* Description   : MMC driver SFR common definitions
*************************************************************************************
* History       : DD.MM.YYYY Version Description
*               : 04.06.2021 Ver1.00
*""FILE COMMENT END""***************************************************************/
#ifndef __MMC_SFR_H__
#define __MMC_SFR_H__
#include "r_mmc_user_config.h"
#include "r_cg_macrodriver.h"

/************************************************************************************************/
/* Definitions                                                                                  */
/************************************************************************************************/
/*<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*/
/*                              Do not change the following data.                               */
/*<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*/
#define _MMC_DRIVER_CPU_MODULE_NAME_ "RL78G23_CSI"

//#define CAT_2(a,b) a##b
//#define CAT(a,b) CAT_2(a,b)

/*----------------------------------------------------------------------------------------------*/
/*  Define the control port.                                                                    */
/*----------------------------------------------------------------------------------------------*/

#if (MMC_SAU_UNIT == 0)
#if (MMC_SAU_CHANNEL == 0)
#define MMC_CSI_UNIT            0
#define MMC_CSI_CHANNEL         0

#if (MMC_CSI_PIN == 'A')
#define MMC_DATAI_PORTNO        1  /* MMC DataIn Port No.  */
#define MMC_DATAI_BITNO         1  /* MMC DataIn Bit No.   */
#define MMC_CLK_PORTNO          1  /* MMC CLK Port No.     */
#define MMC_CLK_BITNO           0  /* MMC CLK Bit  No.     */
#define MMC_DATAO_PORTNO        1  /* MMC DataOut Port No. */
#define MMC_DATAO_BITNO         2  /* MMC DataOut Bit No.  */

/*----------- PMCEmn register value -----------*/
#define MMC_PMCE1_TBL       (uint8_t)0xF8
/* 11111000B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE10   : Set to 0     */
/* ||||||+--------- PMCE11   : Set to 0     */
/* |||||+---------- PMCE12   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */

/*----------- PFOE1n register value -----------*/
#define MMC_PFOE1_TBL       (uint8_t)0x05
/* 00000101B */    /* PFOE1n setting         */
/* |||||||+-------- PFOE10 (P12) : Set to 0 */
/* ||||||+--------- Reserved : Set to 1     */
/* |||||+---------- PFOE12 (P10) : Set to 0 */
/* +++++----------- Reserved : Set to 1     */

#elif (MMC_CSI_PIN == 'B')
#define MMC_DATAI_PORTNO        1  /* MMC DataIn Port No.  */
#define MMC_DATAI_BITNO         6  /* MMC DataIn Bit No.   */
#define MMC_CLK_PORTNO          5  /* MMC CLK Port No.     */
#define MMC_CLK_BITNO           5  /* MMC CLK Bit  No.     */
#define MMC_DATAO_PORTNO        1  /* MMC DataOut Port No. */
#define MMC_DATAO_BITNO         7  /* MMC DataOut Bit No.  */

/*----------- PMCEmn register value -----------*/
#define MMC_PMCE1_TBL       (uint8_t)0x3F
/* 00111111B */    /* PMCEmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCE16   : Set to 0     */
/* +--------------- PMCE17   : Set to 0     */

/*----------- CCDE register value -----------*/
#define MMC_CCDE_TBL       (uint8_t)0xFC
/* 11111100B */    /* CCDE setting         */
/* |||||||+-------- CCDE00 (P16) : Set to 0 */
/* ||||||+--------- CCDE01 (P17) : Set to 0 */
/* ++++++---------- Reserved : Set to 1     */

/*----------- PFOE1n register value -----------*/
#define MMC_PFOE1_TBL       (uint8_t)0x05
/* 00000101B */    /* PFOE1n setting         */
/* |||||||+-------- PFOE10 (P17) : Set to 1 */
/* ||||||+--------- Reserved : Set to 0     */
/* |||||+---------- PFOE12 (P55) : Set to 1 */
/* +++++----------- Reserved : Set to 0     */

#endif /* MMC_CSI_PIN */

#define MMC_CSI_SIR_CLEAR       (uint8_t)0x03
/* 00000011B */    /* SIRms setting         */
/* |||||||+-------- OVCTmn   : Clear        */
/* ||||||+--------- PECTmn   : Clear        */
/* ++++++---------- Reserved : Set to 0     */

#define MMC_CLK_SO_BITNO        8
#define MMC_DATAO_SO_BITNO      0

#elif (MMC_SAU_CHANNEL == 1)
#define MMC_CSI_UNIT  0
#define MMC_CSI_CHANNEL  1

#define MMC_DATAI_PORTNO        7  /* MMC DataIn Port No.  */
#define MMC_DATAI_BITNO         4  /* MMC DataIn Bit No.   */
#define MMC_CLK_PORTNO          7  /* MMC CLK Port No.     */
#define MMC_CLK_BITNO           5  /* MMC CLK Bit  No.     */
#define MMC_DATAO_PORTNO        7  /* MMC DataOut Port No. */
#define MMC_DATAO_BITNO         3  /* MMC DataOut Bit No.  */

#define MMC_CSI_SIR_CLEAR       (uint8_t)0x07
/* 00000111B */    /* SIRms setting         */
/* |||||||+-------- OVCTmn   : Clear        */
/* ||||||+--------- PECTmn   : Clear        */
/* |||||+---------- FECTmn   : Clear        */
/* +++++----------- Reserved : Set to 0     */

/*----------- PMCTxx register value -----------*/
#define MMC_PMCT7_TBL       (uint8_t)0xC7
/* 11000111B */    /* PMCTmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCT73   : Set to 0     */
/* |||+------------ PMCT74   : Set to 0     */
/* ||+------------- PMCT75   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */

#define MMC_CLK_SO_BITNO        9
#define MMC_DATAO_SO_BITNO      1

#elif (MMC_SAU_CHANNEL == 2)
#define MMC_CSI_UNIT            1
#define MMC_CSI_CHANNEL         0

#define MMC_DATAI_PORTNO        0  /* MMC DataIn Port No.  */
#define MMC_DATAI_BITNO         3  /* MMC DataIn Bit No.   */
#define MMC_CLK_PORTNO          0  /* MMC CLK Port No.     */
#define MMC_CLK_BITNO           4  /* MMC CLK Bit  No.     */
#define MMC_DATAO_PORTNO        0  /* MMC DataOut Port No. */
#define MMC_DATAO_BITNO         2  /* MMC DataOut Bit No.  */

/*----------- PMCAxx register value -----------*/
#define MMC_PMCA0_TBL       (uint8_t)0xF3
/* 11110011B */    /* PMCAmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCA02   : Set to 0     */
/* ||||++---------- PMCA03   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */

