renesas/ArduinoCore-rl78/libraries/SD/src/Tfat_Drivers/mmc_driver/mmc/rl78/rl78g23_csi_llvm/r_mmc_sfr.h
#elif (MMC_CS0_PORTNO == 14)
#if (MMC_CS0_BITNO == 7)
#define MMC_CS0_PMCA14_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCAmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCA147  : Set to 0     */
#endif /* MMC_CS0_BITNO */
#endif /* MMC_CS0_PORTNO */

#ifndef MMC_CS0_PMCA0_TBL
#define MMC_CS0_PMCA0_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCA0_TBL */
#ifndef MMC_CS0_PMCA1_TBL
#define MMC_CS0_PMCA1_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCA1_TBL */
#ifndef MMC_CS0_PMCA2_TBL
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCA2_TBL */
#ifndef MMC_CS0_PMCA12_TBL
#define MMC_CS0_PMCA12_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCA12_TBL */
#ifndef MMC_CS0_PMCA14_TBL
#define MMC_CS0_PMCA14_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCA14_TBL */

/*----------- PMCTxx (CS0) register value -----------*/
#if (MMC_CS0_PORTNO == 0)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCT0_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT00   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCT0_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCTmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCT01   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 2)
#define MMC_CS0_PMCT0_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCTmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCT02   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 3)
#define MMC_CS0_PMCT0_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCTmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCT03   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 5)
#define MMC_CS0_PMCT0_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT05   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 6)
#define MMC_CS0_PMCT0_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT06   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 2)
#if (MMC_CS0_BITNO == 2)
#define MMC_CS0_PMCT2_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCTmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCT22   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 3)
#define MMC_CS0_PMCT2_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCTmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCT23   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 4)
#define MMC_CS0_PMCT2_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCTmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCT24   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 5)
#define MMC_CS0_PMCT2_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT25   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 6)
#define MMC_CS0_PMCT2_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT26   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 7)
#define MMC_CS0_PMCT2_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCTmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCT27   : Set to 0     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 3)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCT3_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT30   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCT3_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCTmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCT31   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 5)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCT5_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT50   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 6)
#if (MMC_CS0_BITNO == 4)
#define MMC_CS0_PMCT6_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCTmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCT64   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 5)
#define MMC_CS0_PMCT6_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT65   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 6)
#define MMC_CS0_PMCT6_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT66   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 7)
#define MMC_CS0_PMCT6_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCTmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCT67   : Set to 0     */
#endif /* MMC_CS0_BITNO */

