renesas/ArduinoCore-rl78/libraries/SD/src/Tfat_Drivers/mmc_driver/mmc/rl78/rl78g23_csi_llvm/r_mmc_sfr.h
#elif (MMC_CS0_PORTNO == 7)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT70   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCTmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCT71   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 2)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCTmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCT72   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 3)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCTmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCT73   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 4)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCTmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCT74   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 5)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT75   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 6)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT76   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 7)
#define MMC_CS0_PMCT7_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCTmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCT77   : Set to 0     */
#endif /* MMC_CS0_BITNO */
#endif /* MMC_CS0_PORTNO */

#ifndef MMC_CS0_PMCT0_TBL
#define MMC_CS0_PMCT0_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCT0_TBL */
#ifndef MMC_CS0_PMCT2_TBL
#define MMC_CS0_PMCT2_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCT2_TBL */
#ifndef MMC_CS0_PMCT3_TBL
#define MMC_CS0_PMCT3_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCT3_TBL */
#ifndef MMC_CS0_PMCT5_TBL
#define MMC_CS0_PMCT5_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCT5_TBL */
#ifndef MMC_CS0_PMCT6_TBL
#define MMC_CS0_PMCT6_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCT6_TBL */
#ifndef MMC_CS0_PMCT7_TBL
#define MMC_CS0_PMCT7_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCT7_TBL */

/*----------- PMCExx (CS0) register value -----------*/
#if (MMC_CS0_PORTNO == 0)
#if (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCE0_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE01   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 1)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE10   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE11   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 2)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCEmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCE12   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 3)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCEmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCE13   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 4)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCEmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCE14   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 5)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCEmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCE15   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 6)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCEmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCE16   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 7)
#define MMC_CS0_PMCE1_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCEmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCE17   : Set to 0     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 5)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCE5_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE50   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCE5_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE51   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 6)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCE6_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE60   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCE6_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE61   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */
#endif /* MMC_CS0_PORTNO */

#ifndef MMC_CS0_PMCE0_TBL
#define MMC_CS0_PMCE0_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCE0_TBL */
#ifndef MMC_CS0_PMCE1_TBL
#define MMC_CS0_PMCE1_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCE1_TBL */
#ifndef MMC_CS0_PMCE5_TBL
#define MMC_CS0_PMCE5_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCE5_TBL */
#ifndef MMC_CS0_PMCE6_TBL
#define MMC_CS0_PMCE6_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_PMCE6_TBL */

/*----------- CCDE (CS0) register value -----------*/
#if (MMC_CS0_PORTNO == 1)
#if (MMC_CS0_BITNO == 6)
#define MMC_CS0_CCDE_TBL       (uint8_t)0xFE
/* 11111110B */    /* CCDE setting         */
/* |||||||+-------- CCDE00 (P16) : Set to 0 */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 7)
#define MMC_CS0_CCDE_TBL       (uint8_t)0xFD
/* 11111101B */    /* CCDE setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- CCDE01 (P17) : Set to 0 */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */
#endif /* MMC_CS0_PORTNO */

#ifndef MMC_CS0_CCDE_TBL
#define MMC_CS0_CCDE_TBL       (uint8_t)0xFF
#endif /* MMC_CS0_CCDE_TBL */


