renesas/ArduinoCore-rl78/libraries/SD/src/Tfat_Drivers/mmc_driver/mmc/rl78/rl78g23_csi_llvm/r_mmc_sfr.h
/*----------------- DataOut control ------------------*/
#define MMC_DATAO_INIT()        do               /* DataOut initial setting                     */ \
    {                                                                                              \
    } while (0)

#define MMC_DATAO_OPEN()        do               /* DataOut open setting                        */ \
    {                                                                                              \
    } while (0)

/*------------------- CLK control --------------------*/
#define MMC_CLK_INIT()          do               /* CLK initial setting                         */ \
    {                                                                                              \
    } while (0)

#define MMC_CLK_OPEN()          do                /* CLK open setting                           */ \
    {                                                                                              \
    } while (0)

/*------------------ DETECT control ------------------*/
#if defined(MMC_DETECT0_CONNECTION)
#define MMC_DETECT0_INIT() do                    /* DETECT initial setting                      */ \
    {                                                                                              \
        MMC_PM_DETECT0     = MMC_TRUE;           /* DETECT   Input                              */ \
    } while (0)

#define MMC_GET_DETECT0(Lv) do                   /* DETECT input control                        */ \
    {                                                                                              \
        Lv = MMC_PORT_DETECT0;                                                                     \
    } while (0)
#else /* #if defined(MMC_DETECT0_CONNECTION) */
#define MMC_DETECT0_INIT()                       /* DETECT initial setting                      */
#define MMC_GET_DETECT0(Lv)                      /* DETECT input control                        */
#endif /* #if defined(MMC_DETECT0_CONNECTION) */


#if (MMC_SLOT_NUM > 1)
#if defined(MMC_DETECT1_CONNECTION)
#define MMC_DETECT1_INIT() do                    /* DETECT initial setting                      */ \
    {                                                                                              \
        MMC_PM_DETECT1     = MMC_TRUE;           /* DETECT   Input                              */ \
    } while (0)

#define MMC_GET_DETECT1(Lv) do                   /* DETECT input control                        */ \
    {                                                                                              \
        Lv = MMC_PORT_DETECT1;                                                                     \
    } while (0)
#else /* #if defined(MMC_DETECT0_CONNECTION) */
#define MMC_DETECT1_INIT()                       /* DETECT initial setting                      */
#define MMC_GET_DETECT1(Lv)                      /* DETECT input control                        */
#endif /* #if defined(MMC_DETECT1_CONNECTION) */
#endif /* #if (MMC_SLOT_NUM > 1) */

#if (MMC_SLOT_NUM == 1)
#define MMC_DETECT_INIT(SlotNo) do               /* DETECT initial setting                      */ \
    {                                                                                              \
        MMC_DETECT0_INIT();                                                                        \
    } while (0)
#define MMC_GET_DETECT(SlotNo, Lv) do            /* DETECT input control                        */ \
    {                                                                                              \
        Lv = MMC_NOT_CONNECT;                    /* Initialize by non-detection                 */ \
        MMC_GET_DETECT0(Lv);                                                                       \
    } while (0)
#endif /* #if (MMC_SLOT_NUM > 1) */

#if (MMC_SLOT_NUM > 1)
#define MMC_DETECT_INIT(SlotNo) do               /* DETECT initial setting                      */ \
    {                                                                                              \
        switch (SlotNo) {                                                                          \
            case MMC_SLOT0:  MMC_DETECT0_INIT();        break;                                     \
            case MMC_SLOT1:  MMC_DETECT1_INIT();        break;                                     \
            default:                                    break;                                     \
        }                                                                                          \
    } while (0)
#define MMC_GET_DETECT(SlotNo, Lv) do            /* DETECT input control                        */ \
    {                                                                                              \
        Lv = MMC_NOT_CONNECT;                    /* Initialize by non-detection                 */ \
        switch (SlotNo)                                                                            \
        {                                                                                          \
            case MMC_SLOT0:  MMC_GET_DETECT0(Lv);    break;                                        \
            case MMC_SLOT1:  MMC_GET_DETECT1(Lv);    break;                                        \
            default:                                 break;                                        \
        }                                                                                          \
    } while (0)
#endif /* #if (MMC_SLOT_NUM > 1) */

/*-------------------- CS control --------------------*/
#if (MMC_SLOT_NUM == 1)
#define MMC_CS_INIT(SlotNo)     do               /* CS initial setting                          */ \
    {                                                                                              \
        MMC_PORT_CS0       = MMC_HI;             /* CS0    "H"                                  */ \
        MMC_PM_CS0         = MMC_FALSE;          /* CS0    Output                               */ \
    } while (0)

#define MMC_CS_OPEN(SlotNo)     do               /* CS open setting                             */ \
    {                                                                                              \
        MMC_PM_CS0     = MMC_TRUE;               /* CS0    Input                                */ \
    } while (0)

#define MMC_SET_CS(SlotNo, Lv) do                /* CS output control                           */ \
    {                                                                                              \
        MMC_PORT_CS0       = Lv;                                                                   \
    } while (0)
#endif /* #if (MMC_SLOT_NUM == 1) */

#if (MMC_SLOT_NUM > 1)
#define MMC_CS_INIT(SlotNo)     do               /* CS initial setting                          */ \
    {                                                                                              \
        switch (SlotNo)                                                                            \
        {                                                                                          \
            case MMC_SLOT0:                                                                        \
                MMC_PORT_CS0  = MMC_HI;          /* CS0    Output                               */ \
                MMC_PM_CS0    = MMC_FALSE;       /* CS0    "H"                                  */ \
                break;                                                                             \
            case MMC_SLOT1:                                                                        \
                MMC_PORT_CS1  = MMC_HI;          /* CS1    Output                               */ \
                MMC_PM_CS1    = MMC_FALSE;       /* CS1    "H"                                  */ \
                break;                                                                             \
            default:                                                                               \
                break;                                                                             \
        }                                                                                          \
    } while (0)

#define MMC_CS_OPEN(SlotNo)     do               /* CS open setting                             */ \
    {                                                                                              \
        switch (SlotNo)                                                                            \
        {                                                                                          \
            case MMC_SLOT0:  MMC_PM_CS0 = MMC_TRUE; break; /* CS0   Input                       */ \
            case MMC_SLOT1:  MMC_PM_CS1 = MMC_TRUE; break; /* CS1   Input                       */ \
            default:                                break;                                         \
        }                                                                                          \
    } while (0)

#define MMC_SET_CS(SlotNo, Lv)  do               /* CS output control                           */ \
    {                                                                                              \
        switch (SlotNo)                                                                            \
        {                                                                                          \
            case MMC_SLOT0:  MMC_PORT_CS0 = Lv;  break;                                            \
            case MMC_SLOT1:  MMC_PORT_CS1 = Lv;  break;                                            \
            default:                             break;                                            \
        }                                                                                          \
    } while (0)

#endif /* #if (MMC_SLOT_NUM > 1) */

/*------------------- CSI control -------------------*/
#define MMC_CSI_ERR_CLEAR()     do               /* CSI enable setting                          */ \
    {                                                                                              \
        MMC_CSI_SIRmnL  = MMC_CSI_SIR_CLEAR;     /* clear error flag                            */ \
    } while (0)


#define MMC_CSI_EI() do                          /* CSI enable setting                          */ \
    {                                                                                              \
        MMC_SAUmRES     = MMC_FALSE;             /* SAUm reset control                          */ \
        MMC_SAUmEN      = MMC_TRUE;              /* supply SAUm clock                           */ \
        __nop();                                 /* wait 4 clocks                               */ \
        __nop();                                                                                   \
        __nop();                                                                                   \
        __nop();                                                                                   \
        MMC_CSI_SPSmL   = (MMC_CSI_SPSmL & MMC_SPS_MASK | MMC_SPS_SET); /* Serial clock setting */ \
        MMC_CSI_STmn    =  MMC_TRUE;             /* clear error flag                            */ \
        MMC_CSI_MKmn    =  MMC_TRUE;             /* disable INTCSImn interrupt                  */ \
        MMC_CSI_IFmn    =  MMC_FALSE;            /* clear INTCSImn interrupt flag               */ \
        MMC_CSI_SIRmnL  =  MMC_CSI_SIR_CLEAR;    /* clear error flag                            */ \
        MMC_CSI_SCRmn   =  MMC_SCR_INIT;         /* init SCR setting                            */ \
        MMC_CSI_SOm     |= MMC_CLKOUT_BIT;                                                         \
        MMC_CSI_SOm     |= MMC_SOOUT_BIT;                                                          \
        MMC_CSI_SOEmn   =  MMC_TRUE;                                                               \
        MMC_CSI_ISC     &= MMC_ISC_TBL;                                                            \
    } while (0)

